In [1]:
import pandas as pd
from datetime import datetime
from dateutil.parser import parse
import numpy as np
raw_data = {'employee_name': ['Andy', 'Beth', 'Cindy', "Dale"],
            'employee_id': [123456,789456,654123,963852],
            'date_joined': ['2015-02-15', np.nan, '2017-05-16', "2018-01-15"],
            'age': [45,36,34,25],
            'yrs_of_experience': [24,14,14,4]}
df = pd.DataFrame(raw_data, columns = ['employee_name', 'employee_id', 'date_joined','age', 'yrs_of_experience'])
df

  employee_name  employee_id date_joined  age  yrs_of_experience
0          Andy       123456  2015-02-15   45                 24
1          Beth       789456         NaN   36                 14
2         Cindy       654123  2017-05-16   34                 14
3          Dale       963852  2018-01-15   25                  4

In [ ]:
#fill na with Dec 1, 2009 as given